{
	"pto-scheduler-web-app": {
		"header": {
			"img": "header.jpg",
			"title": "PTO Scheduler Web App",
			"tags": "Interaction Design",
			"client": "Avenue Code",
			"year": "2018",
			"tools": "Sketch"
		},
		"text": [
            "ACDC is a work time management tool that enables Avenue Code’s team to log in work hours and create requests for PTO, known as Vacation Time Off in Brazil. With a new \"Plus\" suffix added, ACDC is being gradually redesigned to expand its features starting with a new PTO scheduler. As design lead of the project, the first step was to gather requirements from stakeholders and users, since the feature must adhere to a number of legal and business rules.",
			"ACDC Plus PTO scheduler takes into consideration two distinct user roles within the tool: the regular user, which can create and visualize requests; and the admin user, which can do that in addition of approving/denying other users’ requests. The goal was to craft a similar experience for both roles that could be only different enough to support the admin extra features.",
			"Moreover, its new design was also created taking into consideration the newly-developed Avenue Code Design System, which was heavily built on top of this app. It was a two-way street: ACDC Plus influenced the Design System, and the Design System influenced ACDC Plus."
		],
		"links": [
			{
				"text": "Avenue Code Design System",
				"url": "https://pedrofelipefroes.github.io/work/avenue-code-design-system/avenue-code-design-system.html"
			}
		],
		"img-list": [
			{
				"alt": "Early wireframe for ACDC Plus PTO scheduler, by Froes, Designer and Developer",
				"url": "acdc-wireframe.jpg",
				"caption": "A paper-made wireframe with the overall layout idea was done after the talks with stakeholders and users were conducted."
			},
			{
				"alt": "ACDC Plus PTO scheduler UI Design, by Froes, Designer and Developer",
				"url": "acdc-ui-desktop.png",
				"caption": "ACDC Plus PTO scheduler UI design was done taking into consideration its two distinct user experiences, in addition of making room for other features to be added at a later date."
			},
			{
				"alt": "ACDC Plus PTO scheduler UI Design for Mobile, by Froes, Designer and Developer",
				"url": "acdc-ui-mobile.png",
				"caption": "ACDC Plus PTO scheduler UI design was also done taking responsiveness into consideration as its layout was projected to adapt according to the screen medium."
			},
			{
				"alt": "ACDC Plus PTO scheduler UI Design Graphic, by Froes, Designer and Developer",
				"url": "acdc-ui-graphic.jpg"
			}
		]
	}
}
