{
	"about": {
		"header": {
            "title": "Nice to meet you! I am Froes.",
            "content": [
                "Also called Pedro, PF, or that nerdy design guy. I am a Designer and Developer graduated in Computer Engineering and currently working at Avenue Code.",
                "Creativity has always been a passion of mine, and I'm excited to apply it in both designing and coding. In addition, I highly value being organized, and this helps me in documenting my designs and developing practical code."
            ],
            "links": {
                "text": "my resumé here",
                "url": "https://www.dropbox.com/s/8mnxh7c2ue2xawy/UX-UI-Developer_PedroFelipeFroes.pdf?dl=0"
            }
        },
        "timeline": {
            "1": {
                "color": "#D3A796",
                "text": "Drawing is a passion that sprung at an early age. I’ve explored a lot of styles over the years and even sold some to pay for my pre-college prep course."
            },
            "2": {
                "color": "#899B96",
                "text": "Started majoring in Civil Engineering, but that wasn’t working out for me. Went on to an academic exchange in Chicago and unleashed the developer inside as I started to learn to code."
            },
            "3": {
                "color": "#485863",
                "text": "Enrolled in Computer Engineering at CEFET-MG and leaned even more about software development. The course was ranked the 2nd best Computer Engineering graduation in Brazil in 2018."
            },
            "4": {
                "color": "#767671",
                "text": "Got into a scholarship on UI/UX where I could learn and explore more how to bring my artsy side to computing. Found myself as a designer and developer."
            },
            "5": {
                "color": "#C3C9CE",
                "text": "Started working at Avenue Code. This amazing company gave me room to explore Visual Design, UI and UX Design, and Front-end Development."
            },
            "6": {
                "color": "#E6E1ED",
                "text": "Matured inside the Avenue Code, and got to work with Email Design and designing for Marketing. Even launched my own Design System project inside the company!"
            },
            "7": {
                "color": "#2D3845",
                "text": "I believe there's always room for growing and improving, so I'm eager to see what the future holds—and I'd be excited to team up and shape our stories together."
            }
        },
        "img-list": [
            {
				"alt": "Picture by Froes, Designer and Developer",
				"url": "img/about-1.jpg",
				"caption": "Casually—and not spontaneously at all—designing and coding."
            }
        ]
    }
}
